_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_1 (Dense)              (None, 4096)              16781312
_________________________________________________________________
dense_2 (Dense)              (None, 20)                81940
=================================================================
Total params: 16,863,252
Trainable params: 16,863,252
Non-trainable params: 0
_________________________________________________________________
Number of Epochs: 10
Validation loss: 15.304131317138673
Validation accuracy: 0.0505
Test fractional accuracy: 0.0
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 63, 63, 64)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 254016)            0
_________________________________________________________________
dense_1 (Dense)              (None, 20)                5080340
=================================================================
Total params: 5,080,980
Trainable params: 5,080,980
Non-trainable params: 0
_________________________________________________________________
Number of Epochs: 10Validation loss: 2.4561010160446166
Validation accuracy: 0.35675
Test fractional accuracy: 0.0
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 63, 63, 64)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 254016)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               32514176  
_________________________________________________________________
dense_2 (Dense)              (None, 20)                2580      
=================================================================
Total params: 32,517,396
Trainable params: 32,517,396
Non-trainable params: 0
_________________________________________________________________
Length of square: 128
Interfaces per zeta: 1000
Number of Epochs: 10
Validation loss: 0.8530463006496429
Validation accuracy: 0.7675
zetas_test = [0.2  0.9  0.05 0.8  0.05 0.9  0.65 0.65 0.8  0.2 ]
zetas_pred = [0.35 0.8  0.15 0.85 0.15 0.8  1.   0.7  0.65 0.35]
Test fractional accuracy: 0.0
*****************************************************************
