_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_1 (Dense)              (None, 4096)              16781312
_________________________________________________________________
dense_2 (Dense)              (None, 20)                81940
=================================================================
Total params: 16,863,252
Trainable params: 16,863,252
Non-trainable params: 0
_________________________________________________________________
Number of Epochs: 10
Validation loss: 15.304131317138673
Validation accuracy: 0.0505
Test fractional accuracy: 0.0
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 63, 63, 64)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 254016)            0
_________________________________________________________________
dense_1 (Dense)              (None, 20)                5080340
=================================================================
Total params: 5,080,980
Trainable params: 5,080,980
Non-trainable params: 0
_________________________________________________________________
Number of Epochs: 10
Validation loss: 2.4561010160446166
Validation accuracy: 0.35675
Test fractional accuracy: 0.0
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 63, 63, 64)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 254016)            0
_________________________________________________________________
dense_1 (Dense)              (None, 128)               32514176
_________________________________________________________________
dense_2 (Dense)              (None, 20)                2580
=================================================================
Total params: 32,517,396
Trainable params: 32,517,396
Non-trainable params: 0
_________________________________________________________________
Length of square: 128
Interfaces per zeta: 1000
Number of Epochs: 10
Validation loss: 0.8530463006496429
Validation accuracy: 0.7675
zetas_test = [0.2  0.9  0.05 0.8  0.05 0.9  0.65 0.65 0.8  0.2 ]
zetas_pred = [0.35 0.8  0.15 0.85 0.15 0.8  1.   0.7  0.65 0.35]
Test fractional accuracy: 0.0
RMS Error: 0.15
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 61, 61, 64)        36928
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 30, 30, 64)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 30, 30, 64)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 57600)             0
_________________________________________________________________
dense_1 (Dense)              (None, 128)               7372928
_________________________________________________________________
dense_2 (Dense)              (None, 20)                2580
=================================================================
Total params: 7,413,076
Trainable params: 7,413,076
Non-trainable params: 0
_________________________________________________________________
Length of square: 128
Interfaces per zeta: 1000
Number of Epochs: 10
Validation loss: 0.4419469838738441
Validation accuracy: 0.88625
zetas_test = [0.2  0.9  0.05 0.8  0.05 0.9  0.65 0.65 0.8  0.2 ]
zetas_pred = [0.35 0.5  0.15 0.9  0.05 0.95 1.   0.95 0.7  0.65]
Test fractional accuracy: 10.0% #byhand
RMS Error: 0.25
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 61, 61, 32)        18464
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 30, 30, 32)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 30, 30, 32)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 28800)             0
_________________________________________________________________
dense_1 (Dense)              (None, 128)               3686528
_________________________________________________________________
dense_2 (Dense)              (None, 20)                2580
=================================================================
Total params: 3,708,212
Trainable params: 3,708,212
Non-trainable params: 0
_________________________________________________________________
Length of square: 128
Interfaces per zeta: 1000
Number of Epochs: 10
Validation loss: 0.3149984914958477
Validation accuracy: 0.903
zetas_test = [0.2  0.9  0.05 0.8  0.05 0.9  0.65 0.65 0.8  0.2 ]
zetas_pred = [0.4  0.5  0.15 0.85 0.05 0.95 0.65 0.6  0.7  0.2 ]
Test fractional accuracy: 30.0% #byhand
RMS Error: 0.15
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 61, 61, 32)        18464
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 30, 30, 32)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 30, 30, 32)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 28800)             0
_________________________________________________________________
dense_1 (Dense)              (None, 128)               3686528
_________________________________________________________________
dense_2 (Dense)              (None, 64)                8256
_________________________________________________________________
dense_3 (Dense)              (None, 20)                1300
=================================================================
Total params: 3,715,188
Trainable params: 3,715,188
Non-trainable params: 0
_________________________________________________________________
Length of square: 128
Interfaces per zeta: 1000
Number of Epochs: 10
Validation loss: 0.2748716212958097
Validation accuracy: 0.91475
zetas_test = [0.2  0.9  0.05 0.8  0.05 0.9  0.65 0.65 0.8  0.2 ]
zetas_pred = [0.4  0.5  0.15 0.85 0.05 0.8  1.   0.6  0.6  0.2 ]
Test fractional accuracy: 20.0% #byhand
RMS Error: 0.2
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 61, 61, 32)        18464
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 30, 30, 32)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 30, 30, 32)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 28800)             0
_________________________________________________________________
dense_1 (Dense)              (None, 256)               7373056
_________________________________________________________________
dense_2 (Dense)              (None, 128)               32896
_________________________________________________________________
dense_3 (Dense)              (None, 20)                2580
=================================================================
Total params: 7,427,636
Trainable params: 7,427,636
Non-trainable params: 0
_________________________________________________________________
Length of square: 128
Interfaces per zeta: 1000
Number of Epochs: 10
Validation loss: 0.2137865962535143
Validation accuracy: 0.94
zetas_test = [0.2  0.9  0.05 0.8  0.05 0.9  0.65 0.65 0.8  0.2 ]
zetas_pred = [0.4  0.5  0.25 0.3  0.05 0.8  1.   0.7  0.7  0.2 ]
Test fractional accuracy: 20.0% #byhand
RMS Error: 0.25
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 61, 61, 32)        18464
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 30, 30, 32)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 30, 30, 32)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 28800)             0
_________________________________________________________________
dense_1 (Dense)              (None, 256)               7373056
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0
_________________________________________________________________
dense_2 (Dense)              (None, 128)               32896
_________________________________________________________________
dense_3 (Dense)              (None, 20)                2580
=================================================================
Total params: 7,427,636
Trainable params: 7,427,636
Non-trainable params: 0
_________________________________________________________________
Length of square: 128
Interfaces per zeta: 1000
Number of Epochs: 10
Validation loss: 0.2717617143392563
Validation accuracy: 0.913 #worse; take out second dropout
zetas_test = [0.2  0.9  0.05 0.8  0.05 0.9  0.65 0.65 0.8  0.2 ]
zetas_pred = [0.35 0.5  0.15 0.9  0.05 0.95 0.65 0.6  0.9  0.2 ]
Test fractional accuracy: 0.0 #for some reason, this is not working!!!
RMS Error: 0.15
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 61, 61, 32)        18464
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 30, 30, 32)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 30, 30, 32)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 28800)             0
_________________________________________________________________
dense_1 (Dense)              (None, 512)               14746112
_________________________________________________________________
dense_2 (Dense)              (None, 128)               65664
_________________________________________________________________
dense_3 (Dense)              (None, 20)                2580
=================================================================
Total params: 14,833,460
Trainable params: 14,833,460
Non-trainable params: 0
_________________________________________________________________
Length of square: 128
Interfaces per zeta: 1000
Number of Epochs: 10
Validation loss: 0.18326753511279822
Validation accuracy: 0.945
zetas_test = [0.2  0.9  0.05 0.8  0.05 0.9  0.65 0.65 0.8  0.2 ]
zetas_pred = [0.4  0.5  0.15 0.85 0.05 0.8  1.   0.6  0.6  0.65]
Test fractional accuracy: 0.0
RMS Error: 0.24
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 61, 61, 32)        18464
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 30, 30, 32)        0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 28, 28, 16)        4624
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 14, 14, 16)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 14, 14, 16)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 3136)              0
_________________________________________________________________
dense_1 (Dense)              (None, 512)               1606144
_________________________________________________________________
dense_2 (Dense)              (None, 128)               65664
_________________________________________________________________
dense_3 (Dense)              (None, 20)                2580
=================================================================
Total params: 1,698,116
Trainable params: 1,698,116
Non-trainable params: 0
_________________________________________________________________
Length of square: 128
Interfaces per zeta: 1000
Number of Epochs: 10
Validation loss: 0.15318822559714318
Validation accuracy: 0.94675
zetas_test = [0.2  0.9  0.05 0.8  0.05 0.9  0.65 0.65 0.8  0.2 ]
zetas_pred = [0.4  0.5  0.25 0.9  0.15 0.5  1.   0.6  0.9  0.3 ]
Test fractional accuracy: 0.0
RMS Error: 0.24
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 61, 61, 32)        18464
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 30, 30, 32)        0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 28, 28, 16)        4624
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 14, 14, 16)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 14, 14, 16)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 3136)              0
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              3212288
_________________________________________________________________
dense_2 (Dense)              (None, 512)               524800
_________________________________________________________________
dense_3 (Dense)              (None, 128)               65664
_________________________________________________________________
dense_4 (Dense)              (None, 20)                2580
=================================================================
Total params: 3,829,060
Trainable params: 3,829,060
Non-trainable params: 0
_________________________________________________________________
Length of square: 128
Interfaces per zeta: 1000
Number of Epochs: 10
Validation loss: 0.11001627341657877
Validation accuracy: 0.964
zetas_test = [0.2  0.9  0.05 0.8  0.05 0.9  0.65 0.65 0.8  0.2 ]
zetas_pred = [0.4  0.5  0.25 0.2  0.15 0.8  0.6  0.6  0.7  0.75]
Test fractional accuracy: 0.0
RMS Error: 0.31
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 61, 61, 32)        18464
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 30, 30, 32)        0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 28, 28, 16)        4624
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 14, 14, 16)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 14, 14, 16)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 3136)              0
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              3212288
_________________________________________________________________
dense_2 (Dense)              (None, 512)               524800
_________________________________________________________________
dense_3 (Dense)              (None, 128)               65664
_________________________________________________________________
dense_4 (Dense)              (None, 20)                2580
=================================================================
Total params: 3,829,060
Trainable params: 3,829,060
Non-trainable params: 0
_________________________________________________________________
Length of square: 128
Interfaces per zeta: 1000
Number of Epochs: 10
Validation loss: 0.11048723837733268
Validation accuracy: 0.96425
zetas_test = [0.65 0.45 0.35 0.65 0.4  0.4  0.35 0.45 0.35 0.35]
zetas_pred = [0.05 0.05 0.25 0.6  0.55 0.55 0.55 0.5  0.65 0.5 ]
Test fractional accuracy: 0.0
RMS Error: 0.27
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 61, 61, 32)        18464
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 30, 30, 32)        0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 28, 28, 16)        4624
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 14, 14, 16)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 14, 14, 16)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 3136)              0
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              3212288
_________________________________________________________________
dense_2 (Dense)              (None, 512)               524800
_________________________________________________________________
dense_3 (Dense)              (None, 128)               65664
_________________________________________________________________
dense_4 (Dense)              (None, 20)                2580
=================================================================
Total params: 3,829,060
Trainable params: 3,829,060
Non-trainable params: 0
_________________________________________________________________
Length of square: 128
Interfaces per zeta: 1000
Number of Epochs: 10
Validation loss: 0.09383234671130776
Validation accuracy: 0.9675
zetas_test = [0.05 0.5  0.45 0.55 0.8  0.5  0.55 0.05 0.8  0.45]
zetas_pred = [0.7  0.45 0.3  0.8  0.7  0.05 0.65 0.35 0.35 0.5 ]
Test fractional accuracy: 0.0
RMS Error: 0.32
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 61, 61, 32)        18464
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 30, 30, 32)        0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 28, 28, 16)        4624
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 14, 14, 16)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 3136)              0
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              3212288
_________________________________________________________________
dense_2 (Dense)              (None, 512)               524800
_________________________________________________________________
dense_3 (Dense)              (None, 128)               65664
_________________________________________________________________
dense_4 (Dense)              (None, 20)                2580
=================================================================
Total params: 3,829,060
Trainable params: 3,829,060
Non-trainable params: 0
_________________________________________________________________
Length of square: 128
Interfaces per zeta: 1000
Number of Epochs: 10
Validation loss: 0.1680950862132013
Validation accuracy: 0.9475
zetas_test = [0.75 0.7  0.55 0.55 0.55 0.75 1.   0.55 0.7  1.  ]
zetas_pred = [0.6  0.9  0.45 0.55 0.55 0.6  0.85 1.   0.9  0.85]
Test fractional accuracy: 0.2
RMS Error: 0.2
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 61, 61, 32)        18464
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 30, 30, 32)        0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 28, 28, 16)        4624
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 14, 14, 16)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 14, 14, 16)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 3136)              0
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              3212288
_________________________________________________________________
dense_2 (Dense)              (None, 512)               524800
_________________________________________________________________
dense_3 (Dense)              (None, 128)               65664
_________________________________________________________________
dense_4 (Dense)              (None, 20)                2580
=================================================================
Total params: 3,829,060
Trainable params: 3,829,060
Non-trainable params: 0
_________________________________________________________________
Length of square: 128
Interfaces per zeta: 1000
Number of Epochs: 10
Validation loss: 0.1490115443058312
Validation accuracy: 0.95225
zetas_test = [0.75 0.35 0.1  0.45 1.   0.35 0.1  0.45 1.   0.75]
zetas_pred = [0.95 0.1  0.1  0.9  0.95 0.3  0.3  0.9  0.95 0.3 ]
Test fractional accuracy: 0.1
RMS Error: 0.28
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 61, 61, 32)        18464
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 30, 30, 32)        0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 28, 28, 16)        4624
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 14, 14, 16)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 14, 14, 16)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 3136)              0
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              3212288
_________________________________________________________________
dense_2 (Dense)              (None, 512)               524800
_________________________________________________________________
dropout_2 (Dropout)          (None, 512)               0
_________________________________________________________________
dense_3 (Dense)              (None, 128)               65664
_________________________________________________________________
dense_4 (Dense)              (None, 10)                1290
=================================================================
Total params: 3,827,770
Trainable params: 3,827,770
Non-trainable params: 0
_________________________________________________________________
Length of square: 128
Interfaces per zeta: 1000
Number of Epochs: 10
Validation loss: 0.11521182849258184
Validation accuracy: 0.964
Classes: 10 zeta values = [0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1. ]
zetas_test = [0.2 0.4 0.4 0.1 0.2 0.2 0.5 0.2 0.1 0.5]
zetas_pred = [0.2 0.6 1.  0.4 0.3 0.6 0.2 0.1 0.6 0.8]
Test fractional accuracy: 0.1
RMS Error: 0.33
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 61, 61, 32)        18464     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 30, 30, 32)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 28, 28, 16)        4624      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 14, 14, 16)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 14, 14, 16)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 3136)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              3212288   
_________________________________________________________________
dense_2 (Dense)              (None, 512)               524800    
_________________________________________________________________
dropout_2 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 128)               65664     
_________________________________________________________________
dense_4 (Dense)              (None, 20)                2580      
=================================================================
Total params: 3,829,060
Trainable params: 3,829,060
Non-trainable params: 0
_________________________________________________________________
Length of square: 128
Interfaces per zeta: 1000
Number of Epochs: 10
Validation loss: 0.1288268543854356
Validation accuracy: 0.96
Classes: 20 zeta values = [0.05 0.1  0.15 0.2  0.25 0.3  0.35 0.4  0.45 0.5  0.55 0.6  0.65 0.7
 0.75 0.8  0.85 0.9  0.95 1.  ]
zetas_test = [0.2  0.05 0.5  0.2  0.7  0.5  0.05 0.2  0.7  0.2 ]
zetas_pred = [0.35 0.4  0.5  0.2  0.55 0.55 0.1  0.25 0.55 0.05]
Test fractional accuracy: 0.2
RMS Error: 0.15
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 61, 61, 32)        18464     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 30, 30, 32)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 28, 28, 16)        4624      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 14, 14, 16)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 14, 14, 16)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 3136)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              3212288   
_________________________________________________________________
dense_2 (Dense)              (None, 512)               524800    
_________________________________________________________________
dropout_2 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 128)               65664     
_________________________________________________________________
dense_4 (Dense)              (None, 20)                2580      
=================================================================
Total params: 3,829,060
Trainable params: 3,829,060
Non-trainable params: 0
_________________________________________________________________
Length of square: 128
Interfaces per zeta: 2000
Number of Epochs: 10
Validation loss: 0.061911673593334854
Validation accuracy: 0.98175
Classes: 20 zeta values = [0.05 0.1  0.15 0.2  0.25 0.3  0.35 0.4  0.45 0.5  0.55 0.6  0.65 0.7
 0.75 0.8  0.85 0.9  0.95 1.  ]
zetas_test = [0.4  0.55 1.   0.25 0.4  0.25 1.   0.55 0.8  0.8 ]
zetas_pred = [0.35 0.8  0.5  0.25 0.3  0.2  0.5  0.3  0.65 0.65]
Test fractional accuracy: 0.1
RMS Error: 0.26
*****************************************************************
