_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_1 (Dense)              (None, 4096)              16781312
_________________________________________________________________
dense_2 (Dense)              (None, 20)                81940
=================================================================
Total params: 16,863,252
Trainable params: 16,863,252
Non-trainable params: 0
_________________________________________________________________
Number of Epochs: 10
Validation loss: 15.304131317138673
Validation accuracy: 0.0505
Test fractional accuracy: 0.0
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 63, 63, 64)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 254016)            0
_________________________________________________________________
dense_1 (Dense)              (None, 20)                5080340
=================================================================
Total params: 5,080,980
Trainable params: 5,080,980
Non-trainable params: 0
_________________________________________________________________
Number of Epochs: 10
Validation loss: 2.4561010160446166
Validation accuracy: 0.35675
Test fractional accuracy: 0.0
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 63, 63, 64)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 254016)            0
_________________________________________________________________
dense_1 (Dense)              (None, 128)               32514176
_________________________________________________________________
dense_2 (Dense)              (None, 20)                2580
=================================================================
Total params: 32,517,396
Trainable params: 32,517,396
Non-trainable params: 0
_________________________________________________________________
Length of square: 128
Interfaces per zeta: 1000
Number of Epochs: 10
Validation loss: 0.8530463006496429
Validation accuracy: 0.7675
zetas_test = [0.2  0.9  0.05 0.8  0.05 0.9  0.65 0.65 0.8  0.2 ]
zetas_pred = [0.35 0.8  0.15 0.85 0.15 0.8  1.   0.7  0.65 0.35]
Test fractional accuracy: 0.0
RMS Error: 0.15
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 61, 61, 64)        36928
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 30, 30, 64)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 30, 30, 64)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 57600)             0
_________________________________________________________________
dense_1 (Dense)              (None, 128)               7372928
_________________________________________________________________
dense_2 (Dense)              (None, 20)                2580
=================================================================
Total params: 7,413,076
Trainable params: 7,413,076
Non-trainable params: 0
_________________________________________________________________
Length of square: 128
Interfaces per zeta: 1000
Number of Epochs: 10
Validation loss: 0.4419469838738441
Validation accuracy: 0.88625
zetas_test = [0.2  0.9  0.05 0.8  0.05 0.9  0.65 0.65 0.8  0.2 ]
zetas_pred = [0.35 0.5  0.15 0.9  0.05 0.95 1.   0.95 0.7  0.65]
Test fractional accuracy: 10.0% #byhand
RMS Error: 0.25
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 61, 61, 32)        18464
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 30, 30, 32)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 30, 30, 32)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 28800)             0
_________________________________________________________________
dense_1 (Dense)              (None, 128)               3686528
_________________________________________________________________
dense_2 (Dense)              (None, 20)                2580
=================================================================
Total params: 3,708,212
Trainable params: 3,708,212
Non-trainable params: 0
_________________________________________________________________
Length of square: 128
Interfaces per zeta: 1000
Number of Epochs: 10
Validation loss: 0.3149984914958477
Validation accuracy: 0.903
zetas_test = [0.2  0.9  0.05 0.8  0.05 0.9  0.65 0.65 0.8  0.2 ]
zetas_pred = [0.4  0.5  0.15 0.85 0.05 0.95 0.65 0.6  0.7  0.2 ]
Test fractional accuracy: 30.0% #byhand
RMS Error: 0.15
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 61, 61, 32)        18464
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 30, 30, 32)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 30, 30, 32)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 28800)             0
_________________________________________________________________
dense_1 (Dense)              (None, 128)               3686528
_________________________________________________________________
dense_2 (Dense)              (None, 64)                8256
_________________________________________________________________
dense_3 (Dense)              (None, 20)                1300
=================================================================
Total params: 3,715,188
Trainable params: 3,715,188
Non-trainable params: 0
_________________________________________________________________
Length of square: 128
Interfaces per zeta: 1000
Number of Epochs: 10
Validation loss: 0.2748716212958097
Validation accuracy: 0.91475
zetas_test = [0.2  0.9  0.05 0.8  0.05 0.9  0.65 0.65 0.8  0.2 ]
zetas_pred = [0.4  0.5  0.15 0.85 0.05 0.8  1.   0.6  0.6  0.2 ]
Test fractional accuracy: 20.0% #byhand
RMS Error: 0.2
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 61, 61, 32)        18464
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 30, 30, 32)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 30, 30, 32)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 28800)             0
_________________________________________________________________
dense_1 (Dense)              (None, 256)               7373056
_________________________________________________________________
dense_2 (Dense)              (None, 128)               32896
_________________________________________________________________
dense_3 (Dense)              (None, 20)                2580
=================================================================
Total params: 7,427,636
Trainable params: 7,427,636
Non-trainable params: 0
_________________________________________________________________
Length of square: 128
Interfaces per zeta: 1000
Number of Epochs: 10
Validation loss: 0.2137865962535143
Validation accuracy: 0.94
zetas_test = [0.2  0.9  0.05 0.8  0.05 0.9  0.65 0.65 0.8  0.2 ]
zetas_pred = [0.4  0.5  0.25 0.3  0.05 0.8  1.   0.7  0.7  0.2 ]
Test fractional accuracy: 20.0% #byhand
RMS Error: 0.25
*****************************************************************
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 126, 126, 64)      640
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 63, 63, 64)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 61, 61, 32)        18464
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 30, 30, 32)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 30, 30, 32)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 28800)             0
_________________________________________________________________
dense_1 (Dense)              (None, 256)               7373056
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0
_________________________________________________________________
dense_2 (Dense)              (None, 128)               32896
_________________________________________________________________
dense_3 (Dense)              (None, 20)                2580
=================================================================
Total params: 7,427,636
Trainable params: 7,427,636
Non-trainable params: 0
_________________________________________________________________
Length of square: 128
Interfaces per zeta: 1000
Number of Epochs: 10
Validation loss: 0.2717617143392563
Validation accuracy: 0.913 #worse; take out second dropout
zetas_test = [0.2  0.9  0.05 0.8  0.05 0.9  0.65 0.65 0.8  0.2 ]
zetas_pred = [0.35 0.5  0.15 0.9  0.05 0.95 0.65 0.6  0.9  0.2 ]
Test fractional accuracy: 0.0 #for some reason, this is not working!!!
RMS Error: 0.15
*****************************************************************
